STMicroelectronics/STM32CubeL0/Drivers/BSP/STM32L073Z_EVAL/stm32l073z_eval_glass_lcd.c
/**
  ******************************************************************************
  * @file    STM32L073Z_eval_glass_lcd.c
  * @author  MCD Application Team
  * @brief   This file includes the LCD Glass driver for LCD XHO5002B Module of 
  *          STM32L073Z-EVAL board.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright(c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32l073z_eval_glass_lcd.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32L073Z_EVAL
  * @{
  */
  
/** @defgroup STM32L073Z_EVAL_GLASS_LCD STM32L073Z-EVAL Glass LCD
  * @brief This file includes the LCD Glass driver for LCD_XHO5002B Module of 
  *        STM32L073Z-EVAL board.
  * @{
  */ 


/** @defgroup STM32L073Z_EVAL_GLASS_LCD_Private_Defines Private Defines
  * @{
  */ 
#define ASCII_CHAR_SPACE              0x20  /*   */
#define ASCII_CHAR_FORWARD_SLASH      0x2F  /* / */
#define ASCII_CHAR_0                  0x30  /* 0 */
#define ASCII_CHAR_COLON              0x3A  /* : */
#define ASCII_CHAR_AT_SYMBOL          0x40  /* @ */
#define ASCII_CHAR_A                  0x41  /* A */
#define ASCII_CHAR_LEFT_OPEN_BRACKET  0x5B  /* [ */
/**
  * @}
  */   

/** @defgroup STM32L073Z_EVAL_GLASS_LCD_Private_Variables Private Variables
  * @{
  */ 

/**
  @verbatim
================================================================================
                              GLASS LCD MAPPING
================================================================================
               A
       _  ----------
     P|_| |\   |H  /|
         F| G  |  I |B
          |  \ | /  |
          --M-- --N--
          |   /| \  |
         E|  L |  J |C
       _  | /  |K  \|
     Q|_| -----------
              D

A LCD character coding is based on the following matrix:
             COM0    COM1    COM4    COM5     COM6    COM7
  SEG(n)    { 0 ,     0 ,     I ,     B ,      C ,     J }
  SEG(n+1)  { D ,     K ,     A ,     H ,      M ,     N }
  SEG(n+2)  { Q ,     L ,     G ,     F ,      P ,     E }

The character A for example is:
-----------------------------------------------------------
             COM0    COM1     COM4    COM5    COM6     COM7
  SEG(n)    { 0 ,     0 ,      0 ,     1 ,     1 ,      0 }
  SEG(n+1)  { 0 ,     0 ,      1 ,     0 ,     1 ,      1 }
  SEG(n+2)  { 0 ,     0 ,      0 ,     1 ,     0 ,      1 }
   --------------------------------------------------------
           =  0       0        2       5       3        6 hex

   => 'A' = 0x002536

  @endverbatim
  */

LCD_HandleTypeDef LCDHandle;

/* LCD BAR status: To save the bar setting after writing in LCD RAM memory */
uint8_t LCDBar = BATTERYLEVEL_FULL;

/**
  * @brief LETTERS AND NUMBERS MAPPING DEFINITION
  */
const uint32_t Mask[] =
  {
    0x00F00000, 0x000F0000, 0x0000F000, 0x00000F00, 0x000000F0, 0x0000000F
  };
const uint8_t Shift[6] =
  {
    20, 16, 12, 8, 4, 0
  };

uint32_t Digit[6];     /* Digit frame buffer */

/* Letters and number map of the custom LCD 8x40(STM32L073Z-EVAL evaluation board) */
const uint32_t LetterMap[26] =
  {
    /*  A            B          C           D           E            F   */
    0x00002536, 0x00202536, 0x00202404, 0x00222310, 0x00202426, 0x00002426, 
    /*   G            H          I            J           K         L    */ 
    0x00202416, 0x00000536, 0x00222200, 0x00200114, 0x00001425, 0x00200404,
    /*   M          N           O            P          Q         R      */ 
    0x00005514, 0x00004515, 0x00202514, 0x00002526, 0x00002532, 0x00002527,
    /*   S           T           U           V           W           X   */
    0x00202432, 0x00022200, 0x00200514, 0x00041404, 0x00050515, 0x00045001, 
    /*  Y          Z     */
    0x00025000, 0x00243000
  };

const uint32_t NumberMap[10] =
  {
    /*   0           1           2          3           4   */
    0x00202514, 0x00000110, 0x00202126, 0x00202132, 0x00000532,
    /*    5         6            7          8           9   */
    0x00202432, 0x00202436, 0x00002110, 0x00202536, 0x00202532
  };

/* Constant table for cap characters 'A' --> 'Z' */
const uint16_t CapLetterMap[26]=
{
  /* A       B       C       D       E       F       G       H       I  */
  0xFE00, 0x6714, 0x1D00, 0x4714, 0x9D00, 0x9C00, 0x3F00, 0xFA00, 0x0014,
  /* J       K       L       M       N       O       P       Q       R  */
  0x5300, 0x9841, 0x1900, 0x5A48, 0x5A09, 0x5F00, 0xFC00, 0x5F01, 0xFC01,
  /* S       T       U       V       W       X       Y       Z  */
  0xAF00, 0x0414, 0x5b00, 0x18C0, 0x5A81, 0x00C9, 0x0058, 0x05C0
};

/**
  * @}
  */

/** @defgroup STM32L073Z_EVAL_LCD_Private_Functions Private Functions
  * @{
  */
static void Convert(uint8_t* c, Point_Typedef Point, DoublePoint_Typedef DoublePoint);
static void LCD_MspInit(LCD_HandleTypeDef *hlcd);

/**
  * @}
  */ 

/** @defgroup STM32L073Z_EVAL_GLASS_LCD_Exported_Functions Exported Functions
  * @{
  */ 

/**
  * @brief  Configures the LCD GLASS relative GPIO port IOs and LCD peripheral.
  * @retval None
  */
void BSP_LCD_GLASS_Init(void)
{
  LCDHandle.Instance              = LCD;
  LCDHandle.Init.Prescaler        = LCD_PRESCALER_4;
  LCDHandle.Init.Divider          = LCD_DIVIDER_16;
  LCDHandle.Init.Duty             = LCD_DUTY_1_8;
  LCDHandle.Init.Bias             = LCD_BIAS_1_4;
  LCDHandle.Init.VoltageSource    = LCD_VOLTAGESOURCE_INTERNAL;
  LCDHandle.Init.Contrast         = LCD_CONTRASTLEVEL_7;
  LCDHandle.Init.DeadTime         = LCD_DEADTIME_0; 
  LCDHandle.Init.PulseOnDuration  = LCD_PULSEONDURATION_2;
  LCDHandle.Init.BlinkMode        = LCD_BLINKMODE_OFF;
  LCDHandle.Init.BlinkFrequency   = LCD_BLINKFREQUENCY_DIV8;
  LCDHandle.Init.MuxSegment       = LCD_MUXSEGMENT_DISABLE;
  
  __HAL_LCD_RESET_HANDLE_STATE(&LCDHandle);
  
  /* Initialize the LCD */
  LCD_MspInit(&LCDHandle); /*optional*/
  HAL_LCD_Init(&LCDHandle);
  
  BSP_LCD_GLASS_Clear();
  BSP_LCD_GLASS_BarLevelConfig(BATTERYLEVEL_OFF); 
  
