STMicroelectronics/STM32CubeL0/Drivers/BSP/STM32L073Z_EVAL/stm32l073z_eval_glass_lcd.c
        case PIXELCOLUMN_13:
          /* Position : Row = 1 , Column= 13 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x00000001), (uint32_t)0x00000001);
          break;

        case PIXELCOLUMN_14:
          /* Position : Row = 1 , Column= 14 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x00000020), (uint32_t)0x00000020);
          break;

        case PIXELCOLUMN_15:
          /* Position : Row = 1 , Column= 15 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x00000010), (uint32_t)0x00000010);
          break;

        case PIXELCOLUMN_16:
          /* Position : Row = 1 , Column= 16 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x00000008), (uint32_t)0x00000008);
          break;

        case PIXELCOLUMN_17:
          /* Position : Row = 1 , Column= 17 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x00000100), (uint32_t)0x00000100);
          break;

        case PIXELCOLUMN_18:
          /* Position : Row = 1 , Column= 18 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x00000080), (uint32_t)0x00000080);
          break;

        case PIXELCOLUMN_19:
          /* Position : Row = 1 , Column= 19 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x00000040), (uint32_t)0x00000040);
          break;

        default:
          break;

      }
      break;

    case PIXELROW_2:
      switch (PixelColumn)
      {
        case PIXELCOLUMN_1:
          /* Position : Row = 2 , Column= 1 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00000200), (uint32_t)0x00000200);
          break;
        
        case PIXELCOLUMN_2:
          /* Position : Row = 2 , Column= 2 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00004000), (uint32_t)0x00004000);
          break;
        
        case PIXELCOLUMN_3:
          /* Position : Row = 2 , Column= 3 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00002000), (uint32_t)0x00002000);
          break;
        
        case PIXELCOLUMN_4:
          /* Position : Row = 2 , Column= 4 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00001000), (uint32_t)0x00001000);
          break;
        
        case PIXELCOLUMN_5:
          /* Position : Row = 2 , Column= 5 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00020000), (uint32_t)0x00020000);
          break;
        
        case PIXELCOLUMN_6:
          /* Position : Row = 2 , Column= 6 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00010000), (uint32_t)0x00010000);
          break;
        
        case PIXELCOLUMN_7:
          /* Position : Row = 2 , Column= 7 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00008000), (uint32_t)0x00008000);
          break;
        
        case PIXELCOLUMN_8:
          /* Position : Row = 2 , Column= 8 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00100000), (uint32_t)0x00100000);
          break;
        
        case PIXELCOLUMN_9:
          /* Position : Row = 2 , Column= 9 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00080000), (uint32_t)0x00080000);
          break;
        
        case PIXELCOLUMN_10:
          /* Position : Row = 2 , Column= 10 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00040000), (uint32_t)0x00040000);
          break;
        
        case PIXELCOLUMN_11:
          /* Position : Row = 2 , Column= 11 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00000004), (uint32_t)0x00000004);
          break;
        
        case PIXELCOLUMN_12:
          /* Position : Row = 2 , Column= 12 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00000002), (uint32_t)0x00000002);
          break;
        
        case PIXELCOLUMN_13:
          /* Position : Row = 2 , Column= 13 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00000001), (uint32_t)0x00000001);
          break;
        
        case PIXELCOLUMN_14:
          /* Position : Row = 2 , Column= 14 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00000020), (uint32_t)0x00000020);
          break;
        
        case PIXELCOLUMN_15:
          /* Position : Row = 2 , Column= 15 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00000010), (uint32_t)0x00000010);
          break;
        
        case PIXELCOLUMN_16:
          /* Position : Row = 2 , Column= 16 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00000008), (uint32_t)0x00000008);
          break;
        
        case PIXELCOLUMN_17:
          /* Position : Row = 2 , Column= 17 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00000100), (uint32_t)0x00000100);
          break;
        
        case PIXELCOLUMN_18:
          /* Position : Row = 2 , Column= 18 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00000080), (uint32_t)0x00000080);
          break;
        
        case PIXELCOLUMN_19:
          /* Position : Row = 2 , Column= 19 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00000040), (uint32_t)0x00000040);
          break;
        
        default:
          break;
      }
      break;

    case PIXELROW_3:
      switch (PixelColumn)
      {
        case PIXELCOLUMN_1:
          /* Position : Row = 3 , Column= 1 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00200000), (uint32_t)0x00200000);
          break;
        
        case PIXELCOLUMN_2:
          /* Position : Row = 3 , Column= 2 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00400000), (uint32_t)0x00400000);
          break;
        
        case PIXELCOLUMN_3:
          /* Position : Row = 3 , Column= 3 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x00800000), (uint32_t)0x00800000);
          break;
        
