STMicroelectronics/STM32CubeL0/Drivers/BSP/STM32L073Z_EVAL/stm32l073z_eval_glass_lcd.c
        case PIXELCOLUMN_4:
          /* Position : Row = 3 , Column= 4 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x01000000), (uint32_t)0x01000000);
          break;
        
        case PIXELCOLUMN_5:
          /* Position : Row = 3 , Column= 5 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x02000000), (uint32_t)0x02000000);
          break;
        
        case PIXELCOLUMN_6:
          /* Position : Row = 3 , Column= 6 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x04000000), (uint32_t)0x04000000);
          break;
        
        case PIXELCOLUMN_7:
          /* Position : Row = 3 , Column= 7 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x08000000), (uint32_t)0x08000000);
          break;
        
        case PIXELCOLUMN_8:
          /* Position : Row = 3 , Column= 8 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x10000000), (uint32_t)0x10000000);
          break;
        
        case PIXELCOLUMN_9:
          /* Position : Row = 3 , Column= 9*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x20000000), (uint32_t)0x20000000);
          break;
        
        case PIXELCOLUMN_10:
          /* Position : Row = 3 , Column= 10*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x40000000), (uint32_t)0x40000000);
          break;
        
        case PIXELCOLUMN_11:
          /* Position : Row = 3 , Column= 11*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~((uint32_t)0x80000000), (uint32_t)0x80000000);
          break;
        
        case PIXELCOLUMN_12:
          /* Position : Row = 3 , Column= 12*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER5, ~((uint32_t)0x00000001), (uint32_t)0x00000001);
          break;
        
        case PIXELCOLUMN_13:
          /* Position : Row = 3 , Column= 13*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER5, ~((uint32_t)0x00000002), (uint32_t)0x00000002);
          break;
        
        case PIXELCOLUMN_14:
          /* Position : Row = 3 , Column= 14*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER5, ~((uint32_t)0x00000004), (uint32_t)0x00000004);
          break;
        
        case PIXELCOLUMN_15:
          /* Position : Row = 3 , Column= 15*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER5, ~((uint32_t)0x00000008), (uint32_t)0x00000008);
          break;
        
        case PIXELCOLUMN_16:
          /* Position : Row = 3 , Column= 16*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER5, ~((uint32_t)0x00000010), (uint32_t)0x00000010);
          break;
        
        case PIXELCOLUMN_17:
          /* Position : Row = 3 , Column= 17*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER5, ~((uint32_t)0x00000020), (uint32_t)0x00000020);
          break;
        
        case PIXELCOLUMN_18:
          /* Position : Row = 3 , Column= 18*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER5, ~((uint32_t)0x00000040), (uint32_t)0x00000040);
          break;
        
        case PIXELCOLUMN_19:
          /* Position : Row = 3 , Column= 19 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER5, ~((uint32_t)0x00000080), (uint32_t)0x00000080);
          break;

        default:
          break;
      }
      break;

    case PIXELROW_4:
      switch (PixelColumn)
      {
        case PIXELCOLUMN_1:
          /* Position : Row = 4 , Column= 1 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x00200000), (uint32_t)0x00200000);
          break;
        
        case PIXELCOLUMN_2:
          /* Position : Row = 4 , Column= 2 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x00400000), (uint32_t)0x00400000);
          break;
        
        case PIXELCOLUMN_3:
          /* Position : Row = 4 , Column= 3 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x00800000), (uint32_t)0x00800000);
          break;
        
        case PIXELCOLUMN_4:
          /* Position : Row = 4 , Column= 4 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x01000000), (uint32_t)0x01000000);
          break;
        
        case PIXELCOLUMN_5:
          /* Position : Row = 4 , Column= 5 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x02000000), (uint32_t)0x02000000);
          break;
        
        case PIXELCOLUMN_6:
          /* Position : Row = 4 , Column= 6 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x04000000), (uint32_t)0x04000000);
          break;
        
        case PIXELCOLUMN_7:
          /* Position : Row = 4 , Column= 7 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x08000000), (uint32_t)0x08000000);
          break;
        
        case PIXELCOLUMN_8:
          /* Position : Row = 4 , Column= 8 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x10000000), (uint32_t)0x10000000);
          break;
        
        case PIXELCOLUMN_9:
          /* Position : Row = 4 , Column= 9*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x20000000), (uint32_t)0x20000000);
          break;
        
        case PIXELCOLUMN_10:
          /* Position : Row = 4 , Column= 10*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x40000000), (uint32_t)0x40000000);
          break;
        
        case PIXELCOLUMN_11:
          /* Position : Row = 4 , Column= 11*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~((uint32_t)0x80000000), (uint32_t)0x80000000);
          break;
        
        case PIXELCOLUMN_12:
          /* Position : Row = 4 , Column= 12*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER7, ~((uint32_t)0x00000001), (uint32_t)0x00000001);
          break;
        
        case PIXELCOLUMN_13:
          /* Position : Row = 4 , Column= 13*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER7, ~((uint32_t)0x00000002), (uint32_t)0x00000002);
          break;
        
        case PIXELCOLUMN_14:
          /* Position : Row = 4 , Column= 14*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER7, ~((uint32_t)0x00000004), (uint32_t)0x00000004);
          break;
        
        case PIXELCOLUMN_15:
          /* Position : Row = 4 , Column= 15*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER7, ~((uint32_t)0x00000008), (uint32_t)0x00000008);
          break;
        
        case PIXELCOLUMN_16:
          /* Position : Row = 4 , Column= 16*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER7, ~((uint32_t)0x00000010), (uint32_t)0x00000010);
          break;
        
