STMicroelectronics/STM32CubeL0/Drivers/BSP/STM32L073Z_EVAL/stm32l073z_eval_glass_lcd.c
        case PIXELCOLUMN_17:
          /* Position : Row = 8 , Column =17*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER13, (uint32_t)0xFFFFFFDF, 0);
          break;
        
        case PIXELCOLUMN_18:
          /* Position : Row = 8 , Column =18*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER13, (uint32_t)0xFFFFFFBF, 0);
          break;
        
        case PIXELCOLUMN_19:
          /* Position : Row = 8 , Column =19 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER13, (uint32_t)0xFFFFFF7F, 0);
          break;
        
          default:
          break;
        }
      break;
    
    case PIXELROW_9:
      switch (PixelColumn)
        {
        case PIXELCOLUMN_1:
          /* Position : Row = 9 , Column =1 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER10, (uint32_t)0xFFDFFFFF, 0);
          break;
        
        case PIXELCOLUMN_2:
          /* Position : Row = 9 , Column =2 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER10, (uint32_t)0xFFBFFFFF, 0);
          break;
        
        case PIXELCOLUMN_3:
          /* Position : Row = 9 , Column =3 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER10, (uint32_t)0xFF7FFFFF, 0);
          break;
        
        case PIXELCOLUMN_4:
          /* Position : Row = 9 , Column =4 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER10, (uint32_t)0xFEFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_5:
          /* Position : Row = 9 , Column =5 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER10, (uint32_t)0xFDFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_6:
          /* Position : Row = 9 , Column =6 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER10, (uint32_t)0xFBFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_7:
          /* Position : Row = 9 , Column =7 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER10, (uint32_t)0xF7FFFFFF, 0);
          break;
        
        case PIXELCOLUMN_8:
          /* Position : Row = 9 , Column =8 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER10, (uint32_t)0xEFFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_9:
          /* Position : Row = 9 , Column =9*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER10, (uint32_t)0xDFFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_10:
          /* Position : Row = 9 , Column =10*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER10, (uint32_t)0xBFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_11:
          /* Position : Row = 9 , Column =11*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER10, (uint32_t)0x7FFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_12:
          /* Position : Row = 9 , Column =12*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER11, (uint32_t)0xFFFFFFFE, 0);
          break;
        
        case PIXELCOLUMN_13:
          /* Position : Row = 9 , Column =13*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER11, (uint32_t)0xFFFFFFFD, 0);
          break;
        
        case PIXELCOLUMN_14:
          /* Position : Row = 9 , Column =14*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER11, (uint32_t)0xFFFFFFFB, 0);
          break;
        
        case PIXELCOLUMN_15:
          /* Position : Row = 9 , Column =15*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER11, (uint32_t)0xFFFFFFF7, 0);
          break;
        
        case PIXELCOLUMN_16:
          /* Position : Row = 9 , Column =16*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER11, (uint32_t)0xFFFFFFEF, 0);
          break;
        
        case PIXELCOLUMN_17:
          /* Position : Row = 9 , Column =17*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER11, (uint32_t)0xFFFFFFDF, 0);
          break;
        
        case PIXELCOLUMN_18:
          /* Position : Row = 9 , Column =18*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER11, (uint32_t)0xFFFFFFBF, 0);
          break;
        
        case PIXELCOLUMN_19:
          /* Position : Row = 9 , Column =19 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER11, (uint32_t)0xFFFFFF7F, 0);
          break;
        
          default:
          break;
        }
      break;
    
    case PIXELROW_10:
      switch (PixelColumn)
        {
        case PIXELCOLUMN_1:
          /* Position : Row = 10 , Column= 1 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER8, (uint32_t)0xFFDFFFFF, 0);
          break;
        
        case PIXELCOLUMN_2:
          /* Position : Row = 10 , Column= 2 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER8, (uint32_t)0xFFBFFFFF, 0);
          break;
        
        case PIXELCOLUMN_3:
          /* Position : Row = 10 , Column= 3 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER8, (uint32_t)0xFF7FFFFF, 0);
          break;
        
        case PIXELCOLUMN_4:
          /* Position : Row = 10 , Column= 4 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER8, (uint32_t)0xFEFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_5:
          /* Position : Row = 10 , Column= 5 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER8, (uint32_t)0xFDFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_6:
          /* Position : Row = 10 , Column= 6 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER8, (uint32_t)0xFBFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_7:
          /* Position : Row = 10 , Column= 7 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER8, (uint32_t)0xF7FFFFFF, 0);
          break;
        
        case PIXELCOLUMN_8:
          /* Position : Row = 10 , Column= 8 */
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER8, (uint32_t)0xEFFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_9:
          /* Position : Row = 10 , Column= 9*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER8, (uint32_t)0xDFFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_10:
          /* Position : Row = 10 , Column= 10*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER8, (uint32_t)0xBFFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_11:
          /* Position : Row = 10 , Column= 11*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER8, (uint32_t)0x7FFFFFFF, 0);
          break;
        
        case PIXELCOLUMN_12:
          /* Position : Row = 10 , Column= 12*/
          HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER9, (uint32_t)0xFFFFFFFE, 0);
          break;
        
